# CannotGenerateFacesError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotGenerateFacesError Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Couldn't generate surfaces for stairs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotGenerateFacesError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotGenerateFacesError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotGenerateFacesError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace